/*
    -- loop
    while (  เงื่อนไข  ) {
        
    }
    +++++++++++++++++++++++++++++++
    do{
        คําสั่ง...
    }while(  เงื่อนไข  );
    +++++++++++++++++++++++++++++++
    for( ตัสแปรพร้อมค่าเริ่มต้น ; เงื่อนไข ; การเพิ่มค่าตัสแปร ){
        คำสั่ง...
    }
*/

#include <stdio.h>
int main() {
    int i;

    for(i = i;  i <=5; i++) {
        printf("%d - Hello...", i);
    }
    printf("\n----------------------------------\n");
    i = 1;
    while (i <= 5) {
        printf("%d - Hi...", i);
        i++;
    }
    printf("\n----------------------------------\n");
    i = 1;
    do {
        printf("%d - Hey...", i);
        i++;
    } while (i <= 5);
    
}